# IdeaStatiCa.ConnectionApi.Model.IdeaParameter

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Key** | **string** |  | [optional]
**Expression** | **string** |  | [optional]
**Value** | **Object** |  | [optional]
**Unit** | **string** |  | [optional]
**ParameterType** | **string** |  | [optional]
**ValidationExpression** | **string** |  | [optional]
**Description** | **string** |  | [optional]
**ValidationStatus** | **string** |  | [optional]
**IsVisible** | **bool?** |  | [optional]
**LowerBound** | **string** |  | [optional]
**UpperBound** | **string** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)